app/Controllers/Home.php

SELECT *
FROM `buku`
 LIMIT 10, 5
SELECT COUNT(*) AS `numrows`
FROM `buku`
---
    public function buku()
    {
        $model = new BukuModel();
        $keyword = $this->request->getVar('q');

        if ($keyword) {
            $model->like('judul', $keyword)->orLike('penulis', $keyword);
        }

        $data = [
            'buku'    => $model->paginate(5, 'buku'),
            'pager'   => $model->pager,
            'keyword' => $keyword
        ];

SELECT *
FROM `peminjaman`
WHERE `user_id` = '5'
AND `buku_id` = '13'
AND `status` = 'dipinjam'
 LIMIT 1
---
    public function pinjam($id)
    {
        if (!session()->get('logged_in')) return redirect()->to('/login');

        $user_id = session()->get('user_id');

        // Cek apakah user sudah meminjam buku yang sama dan belum dikembalikan
        $existing = $this->peminjamanModel
            ->where('user_id', $user_id)
            ->where('buku_id', $id)
            ->where('status', 'dipinjam')
            ->first();