app/Controllers/User.php

    public function search()
    {
        $keyword = $this->request->getGet('q');
        $query = $this->bukuModel;

        if ($keyword) {
            $query = $query->groupStart()
                           ->like('judul', $keyword)
                           ->orLike('penulis', $keyword)
                           ->groupEnd();
        }

        $data['buku'] = $query->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `buku`
WHERE   (
`judul` LIKE '%Buku Memasak Kue%' ESCAPE '!'
OR  `penulis` LIKE '%Buku Memasak Kue%' ESCAPE '!'
 )
ORDER BY `id` DESC